---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizes.GetBasicIEnumerator
source: html/61619f00-44c0-9693-a553-a2b76465e7cb.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizes.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.